# Poorman's POSIX equivalence classes, hardcoded to the en_US.UTF-8 locale circa 2025.
#
#
# Makes it easy to do a regular expression search for "epee" and match "épée".
# Usage: re.search( equivalence.expand_regex( r'canape' ), words )

class EquivalenceClass:
    '''Define a lookup table for quickly replacing letters with a
    regular expression character class that encompasses all the
    possible accented versions of that letter. E.g., n -> [nñ].
    '''

    table = {}
    table['A']=table['a']="[AaªÀÁÂÃÄÅàáâãäåĀāĂăĄąǍǎǞǟǠǡǺǻȀȁȂȃȦȧᴬᵃḀḁẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặₐÅ⒜ⒶⓐꞚꞛＡａ𝐀𝐚𝐴𝑎𝑨𝒂𝒜𝒶𝓐𝓪𝔄𝔞𝔸𝕒𝕬𝖆𝖠𝖺𝗔𝗮𝘈𝘢𝘼𝙖𝙰𝚊🄐🄰🅐🅰]"
    table['B']=table['b']="[BbᴮᵇḂḃḄḅḆḇℬ⒝ⒷⓑＢｂ𝐁𝐛𝐵𝑏𝑩𝒃𝒷𝓑𝓫𝔅𝔟𝔹𝕓𝕭𝖇𝖡𝖻𝗕𝗯𝘉𝘣𝘽𝙗𝙱𝚋🄑🄱🅑🅱]"
    table['C']=table['c']="[CcÇçĆćĈĉĊċČčᶜḈḉℂ℃ℭⅭⅽ⒞ⒸⓒＣｃ𝐂𝐜𝐶𝑐𝑪𝒄𝒞𝒸𝓒𝓬𝔠𝕔𝕮𝖈𝖢𝖼𝗖𝗰𝘊𝘤𝘾𝙘𝙲𝚌🄒🄫🄲🅒🅲]"
    table['D']=table['d']="[DdÐðĎďĐđᴰᵈᶞḊḋḌḍḎḏḐḑḒḓⅅⅆⅮⅾ⒟ⒹⓓꝹꝺＤｄ𝐃𝐝𝐷𝑑𝑫𝒅𝒟𝒹𝓓𝓭𝔇𝔡𝔻𝕕𝕯𝖉𝖣𝖽𝗗𝗱𝘋𝘥𝘿𝙙𝙳𝚍🄓🄳🅓🅳🆥]"
    table['E']=table['e']="[EeÈÉÊËèéêëĒēĔĕĖėĘęĚěȄȅȆȇȨȩᴱᵉḔḕḖḗḘḙḚḛḜḝẸẹẺẻẼẽẾếỀềỂểỄễỆệₑℯℰⅇ⒠ⒺⓔＥｅ𝐄𝐞𝐸𝑒𝑬𝒆𝓔𝓮𝔈𝔢𝔼𝕖𝕰𝖊𝖤𝖾𝗘𝗲𝘌𝘦𝙀𝙚𝙴𝚎🄔🄴🅔🅴]"
    table['F']=table['f']="[FfᶠḞḟ℉ℱ⒡ⒻⓕꝻꝼＦｆ𝐅𝐟𝐹𝑓𝑭𝒇𝒻𝓕𝓯𝔉𝔣𝔽𝕗𝕱𝖋𝖥𝖿𝗙𝗳𝘍𝘧𝙁𝙛𝙵𝚏🄕🄵🅕🅵]"
    table['G']=table['g']="[GgĜĝĞğĠġĢģǦǧǴǵᴳᵍᵹḠḡℊ⒢ⒼⓖꝽꞠꞡＧｇ𝐆𝐠𝐺𝑔𝑮𝒈𝒢𝓖𝓰𝔊𝔤𝔾𝕘𝕲𝖌𝖦𝗀𝗚𝗴𝘎𝘨𝙂𝙜𝙶𝚐🄖🄶🅖🅶]"
    table['H']=table['h']="[HhĤĥĦħȞȟʰᴴḢḣḤḥḦḧḨḩḪḫẖₕℋℌℍℎℏ⒣ⒽⓗꟸＨｈ𝐇𝐡𝐻𝑯𝒉𝒽𝓗𝓱𝔥𝕙𝕳𝖍𝖧𝗁𝗛𝗵𝘏𝘩𝙃𝙝𝙷𝚑🄗🄷🅗🅷]"
    table['I']=table['i']="[IiÌÍÎÏìíîïĨĩĪīĬĭĮįİǏǐȈȉȊȋᴵᵢḬḭḮḯỈỉỊịⁱℐℑℹⅈⅠⅰ⒤ⒾⓘＩｉ𝐈𝐢𝐼𝑖𝑰𝒊𝒾𝓘𝓲𝔦𝕀𝕚𝕴𝖎𝖨𝗂𝗜𝗶𝘐𝘪𝙄𝙞𝙸𝚒🄘🄸🅘🅸]"
    table['J']=table['j']="[JjĴĵǰʲᴶⅉ⒥ⒿⓙⱼＪｊ𝐉𝐣𝐽𝑗𝑱𝒋𝒥𝒿𝓙𝓳𝔍𝔧𝕁𝕛𝕵𝖏𝖩𝗃𝗝𝗷𝘑𝘫𝙅𝙟𝙹𝚓🄙🄹🅙🅹]"
    table['K']=table['k']="[KkĶķǨǩᴷᵏḰḱḲḳḴḵₖK⒦ⓀⓚꞢꞣＫｋ𝐊𝐤𝐾𝑘𝑲𝒌𝒦𝓀𝓚𝓴𝔎𝔨𝕂𝕜𝕶𝖐𝖪𝗄𝗞𝗸𝘒𝘬𝙆𝙠𝙺𝚔🄚🄺🅚🅺]"
    table['L']=table['l']="[LlĹĺĻļĽľĿŀŁłˡᴸḶḷḸḹḺḻḼḽₗℒℓⅬⅼ⒧ⓁⓛＬｌ𝐋𝐥𝐿𝑙𝑳𝒍𝓁𝓛𝓵𝔏𝔩𝕃𝕝𝕷𝖑𝖫𝗅𝗟𝗹𝘓𝘭𝙇𝙡𝙻𝚕🄛🄻🅛🅻]"
    table['M']=table['m']="[MmᴹᵐḾḿṀṁṂṃₘℳⅯⅿ⒨ⓂⓜＭｍ𝐌𝐦𝑀𝑚𝑴𝒎𝓂𝓜𝓶𝔐𝔪𝕄𝕞𝕸𝖒𝖬𝗆𝗠𝗺𝘔𝘮𝙈𝙢𝙼𝚖🄜🄼🅜🅼]"
    table['N']=table['n']="[NnÑñŃńŅņŇňǸǹᴺṄṅṆṇṈṉṊṋⁿₙℕ⒩ⓃⓝꞤꞥＮｎ𝐍𝐧𝑁𝑛𝑵𝒏𝒩𝓃𝓝𝓷𝔑𝔫𝕟𝕹𝖓𝖭𝗇𝗡𝗻𝘕𝘯𝙉𝙣𝙽𝚗🄝🄽🅝🅽]"
    table['O']=table['o']="[OoºÒÓÔÕÖØòóôõöøŌōŎŏŐőƠơǑǒǪǫǬǭǾǿȌȍȎȏȪȫȬȭȮȯȰȱᴼᵒṌṍṎṏṐṑṒṓỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợₒℴ⒪ⓄⓞꞜꞝＯｏ𝐎𝐨𝑂𝑜𝑶𝒐𝒪𝓞𝓸𝔒𝔬𝕆𝕠𝕺𝖔𝖮𝗈𝗢𝗼𝘖𝘰𝙊𝙤𝙾𝚘🄞🄾🅞🅾]"
    table['P']=table['p']="[PpᴾᵖṔṕṖṗₚℙ⒫ⓅⓟＰｐ𝐏𝐩𝑃𝑝𝑷𝒑𝒫𝓅𝓟𝓹𝔓𝔭𝕡𝕻𝖕𝖯𝗉𝗣𝗽𝘗𝘱𝙋𝙥𝙿𝚙🄟🄿🅟🅿🆊]"
    table['Q']=table['q']="[Qqℚ⒬ⓆⓠＱｑ𝐐𝐪𝑄𝑞𝑸𝒒𝒬𝓆𝓠𝓺𝔔𝔮𝕢𝕼𝖖𝖰𝗊𝗤𝗾𝘘𝘲𝙌𝙦𝚀𝚚🄠🅀🅠🆀]"
    table['R']=table['r']="[RrŔŕŖŗŘřȐȑȒȓʳᴿᵣṘṙṚṛṜṝṞṟℛℜℝ⒭ⓇⓡꞂꞃꞦꞧＲｒ𝐑𝐫𝑅𝑟𝑹𝒓𝓇𝓡𝓻𝔯𝕣𝕽𝖗𝖱𝗋𝗥𝗿𝘙𝘳𝙍𝙧𝚁𝚛🄡🄬🅁🅡🆁]"
    table['S']=table['s']="[SsŚśŜŝŞşŠšſȘșˢṠṡṢṣṤṥṦṧṨṩẛₛ⒮ⓈⓢꞄꞅꞨꞩＳｓ𝐒𝐬𝑆𝑠𝑺𝒔𝒮𝓈𝓢𝓼𝔖𝔰𝕊𝕤𝕾𝖘𝖲𝗌𝗦𝘀𝘚𝘴𝙎𝙨𝚂𝚜🄢🄪🅂🅢🆂]"
    table['T']=table['t']="[TtŢţŤťȚțᵀᵗṪṫṬṭṮṯṰṱẗₜ⒯ⓉⓣꞆꞇＴｔ𝐓𝐭𝑇𝑡𝑻𝒕𝒯𝓉𝓣𝓽𝔗𝔱𝕋𝕥𝕿𝖙𝖳𝗍𝗧𝘁𝘛𝘵𝙏𝙩𝚃𝚝🄣🅃🅣🆃]"
    table['U']=table['u']="[UuÙÚÛÜùúûüŨũŪūŬŭŮůŰűŲųƯưǓǔǕǖǗǘǙǚǛǜȔȕȖȗᵁᵘᵤṲṳṴṵṶṷṸṹṺṻỤụỦủỨứỪừỬửỮữỰự⒰ⓊⓤꞞꞟＵｕ𝐔𝐮𝑈𝑢𝑼𝒖𝒰𝓊𝓤𝓾𝔘𝔲𝕌𝕦𝖀𝖚𝖴𝗎𝗨𝘂𝘜𝘶𝙐𝙪𝚄𝚞🄤🅄🅤🆄]"
    table['V']=table['v']="[VvᵛᵥṼṽṾṿⅤⅴ⒱ⓋⓥⱽＶｖ𝐕𝐯𝑉𝑣𝑽𝒗𝒱𝓋𝓥𝓿𝔙𝔳𝕍𝕧𝖁𝖛𝖵𝗏𝗩𝘃𝘝𝘷𝙑𝙫𝚅𝚟🄥🅅🅥🆅]"
    table['W']=table['w']="[WwŴŵʷᵂẀẁẂẃẄẅẆẇẈẉẘ⒲ⓌⓦＷｗ𝐖𝐰𝑊𝑤𝑾𝒘𝒲𝓌𝓦𝔀𝔚𝔴𝕎𝕨𝖂𝖜𝖶𝗐𝗪𝘄𝘞𝘸𝙒𝙬𝚆𝚠🄦🅆🅦🆆]"
    table['X']=table['x']="[XxˣẊẋẌẍₓⅩⅹ⒳ⓍⓧＸｘ𝐗𝐱𝑋𝑥𝑿𝒙𝒳𝓍𝓧𝔁𝔛𝔵𝕏𝕩𝖃𝖝𝖷𝗑𝗫𝘅𝘟𝘹𝙓𝙭𝚇𝚡🄧🅇🅧🆇]"
    table['Y']=table['y']="[YyÝýÿŶŷŸȲȳʸẎẏẙỲỳỴỵỶỷỸỹ⒴ⓎⓨＹｙ𝐘𝐲𝑌𝑦𝒀𝒚𝒴𝓎𝓨𝔂𝔜𝔶𝕐𝕪𝖄𝖞𝖸𝗒𝗬𝘆𝘠𝘺𝙔𝙮𝚈𝚢🄨🅈🅨🆈]"
    table['Z']=table['z']="[ZzŹźŻżŽžᶻẐẑẒẓẔẕℤℨ⒵ⓏⓩＺｚ𝐙𝐳𝑍𝑧𝒁𝒛𝒵𝓏𝓩𝔃𝔷𝕫𝖅𝖟𝖹𝗓𝗭𝘇𝘡𝘻𝙕𝙯𝚉𝚣🄩🅉🅩🆉]"

    def __init__(self):
        return None

    def __getitem__(self, item):
        if item in self.table:
            return self.table[item];
        else:
            return item;

def expand_regex(string: str):
    ec = EquivalenceClass();
    return ''.join([ ec[k] for k in string ])
