'''EQUIVALENCE: Search for Unicode strings by ASCII approximation.

   This is a poorman's POSIX "Equivalence Class" for Python. 
   It simulates the "[=x=]" notation of POSIX regular expressions
   which match all collating elements equivalent to "x".

   Given an ASCII string, equivalence() returns a regex of bracket
   expressions that matches "equivalent" Unicode characters.

     equivalence('en') -> '[eèėêēéEÈĖÊĒÉ…𝙀𝙚𝙴𝚎🄴🅔🅴][nñNÑ…𝙉𝙣𝙽𝚗🄽🅝🅽]'.

   Usage:
       from equivalence import equivalence
       re.search( equivalence('epee'), words )
       # Matches 'épée' & 'Épée' (and also 'Ｅｐｅｅ', Ḝṗểệ, & '𝓔𝓟ℰⅇ')
    
   Differences from POSIX regular expressions:
    * Fails to match Unicode Combining Characters.
    * Ignores the user's locale. The data is hardcoded to a sample
      taken in late 2025 of the POSIX 'en_US.UTF-8' locale.
    * Input must be ASCII.
    * Can be significantly slower.

   If equivalence() is too slow, use eqv(), which matches only the
   Latin-1 single byte character set instead of Unicode.

     eqv('en') -> '[EeÈÉÊËèéêë][NnÑñ]'

   Usage for eqv():
       from equivalence import eqv
       re.search( eqv('epee'), words )       # matches 'épée' & 'Épée'

'''

_equivalence_table = {}
_equivalence_table['A']=_equivalence_table['a']="[AaªÀÁÂÃÄÅàáâãäåĀāĂăĄąǍǎǞǟǠǡǺǻȀȁȂȃȦȧᴬᵃḀḁẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặₐÅ⒜ⒶⓐꞚꞛＡａ𝐀𝐚𝐴𝑎𝑨𝒂𝒜𝒶𝓐𝓪𝔄𝔞𝔸𝕒𝕬𝖆𝖠𝖺𝗔𝗮𝘈𝘢𝘼𝙖𝙰𝚊🄐🄰🅐🅰]"
_equivalence_table['B']=_equivalence_table['b']="[BbᴮᵇḂḃḄḅḆḇℬ⒝ⒷⓑＢｂ𝐁𝐛𝐵𝑏𝑩𝒃𝒷𝓑𝓫𝔅𝔟𝔹𝕓𝕭𝖇𝖡𝖻𝗕𝗯𝘉𝘣𝘽𝙗𝙱𝚋🄑🄱🅑🅱]"
_equivalence_table['C']=_equivalence_table['c']="[CcÇçĆćĈĉĊċČčᶜḈḉℂ℃ℭⅭⅽ⒞ⒸⓒＣｃ𝐂𝐜𝐶𝑐𝑪𝒄𝒞𝒸𝓒𝓬𝔠𝕔𝕮𝖈𝖢𝖼𝗖𝗰𝘊𝘤𝘾𝙘𝙲𝚌🄒🄫🄲🅒🅲]"
_equivalence_table['D']=_equivalence_table['d']="[DdÐðĎďĐđᴰᵈᶞḊḋḌḍḎḏḐḑḒḓⅅⅆⅮⅾ⒟ⒹⓓꝹꝺＤｄ𝐃𝐝𝐷𝑑𝑫𝒅𝒟𝒹𝓓𝓭𝔇𝔡𝔻𝕕𝕯𝖉𝖣𝖽𝗗𝗱𝘋𝘥𝘿𝙙𝙳𝚍🄓🄳🅓🅳🆥]"
_equivalence_table['E']=_equivalence_table['e']="[EeÈÉÊËèéêëĒēĔĕĖėĘęĚěȄȅȆȇȨȩᴱᵉḔḕḖḗḘḙḚḛḜḝẸẹẺẻẼẽẾếỀềỂểỄễỆệₑℯℰⅇ⒠ⒺⓔＥｅ𝐄𝐞𝐸𝑒𝑬𝒆𝓔𝓮𝔈𝔢𝔼𝕖𝕰𝖊𝖤𝖾𝗘𝗲𝘌𝘦𝙀𝙚𝙴𝚎🄔🄴🅔🅴]"
_equivalence_table['F']=_equivalence_table['f']="[FfᶠḞḟ℉ℱ⒡ⒻⓕꝻꝼＦｆ𝐅𝐟𝐹𝑓𝑭𝒇𝒻𝓕𝓯𝔉𝔣𝔽𝕗𝕱𝖋𝖥𝖿𝗙𝗳𝘍𝘧𝙁𝙛𝙵𝚏🄕🄵🅕🅵]"
_equivalence_table['G']=_equivalence_table['g']="[GgĜĝĞğĠġĢģǦǧǴǵᴳᵍᵹḠḡℊ⒢ⒼⓖꝽꞠꞡＧｇ𝐆𝐠𝐺𝑔𝑮𝒈𝒢𝓖𝓰𝔊𝔤𝔾𝕘𝕲𝖌𝖦𝗀𝗚𝗴𝘎𝘨𝙂𝙜𝙶𝚐🄖🄶🅖🅶]"
_equivalence_table['H']=_equivalence_table['h']="[HhĤĥĦħȞȟʰᴴḢḣḤḥḦḧḨḩḪḫẖₕℋℌℍℎℏ⒣ⒽⓗꟸＨｈ𝐇𝐡𝐻𝑯𝒉𝒽𝓗𝓱𝔥𝕙𝕳𝖍𝖧𝗁𝗛𝗵𝘏𝘩𝙃𝙝𝙷𝚑🄗🄷🅗🅷]"
_equivalence_table['I']=_equivalence_table['i']="[IiÌÍÎÏìíîïĨĩĪīĬĭĮįİǏǐȈȉȊȋᴵᵢḬḭḮḯỈỉỊịⁱℐℑℹⅈⅠⅰ⒤ⒾⓘＩｉ𝐈𝐢𝐼𝑖𝑰𝒊𝒾𝓘𝓲𝔦𝕀𝕚𝕴𝖎𝖨𝗂𝗜𝗶𝘐𝘪𝙄𝙞𝙸𝚒🄘🄸🅘🅸]"
_equivalence_table['J']=_equivalence_table['j']="[JjĴĵǰʲᴶⅉ⒥ⒿⓙⱼＪｊ𝐉𝐣𝐽𝑗𝑱𝒋𝒥𝒿𝓙𝓳𝔍𝔧𝕁𝕛𝕵𝖏𝖩𝗃𝗝𝗷𝘑𝘫𝙅𝙟𝙹𝚓🄙🄹🅙🅹]"
_equivalence_table['K']=_equivalence_table['k']="[KkĶķǨǩᴷᵏḰḱḲḳḴḵₖK⒦ⓀⓚꞢꞣＫｋ𝐊𝐤𝐾𝑘𝑲𝒌𝒦𝓀𝓚𝓴𝔎𝔨𝕂𝕜𝕶𝖐𝖪𝗄𝗞𝗸𝘒𝘬𝙆𝙠𝙺𝚔🄚🄺🅚🅺]"
_equivalence_table['L']=_equivalence_table['l']="[LlĹĺĻļĽľĿŀŁłˡᴸḶḷḸḹḺḻḼḽₗℒℓⅬⅼ⒧ⓁⓛＬｌ𝐋𝐥𝐿𝑙𝑳𝒍𝓁𝓛𝓵𝔏𝔩𝕃𝕝𝕷𝖑𝖫𝗅𝗟𝗹𝘓𝘭𝙇𝙡𝙻𝚕🄛🄻🅛🅻]"
_equivalence_table['M']=_equivalence_table['m']="[MmᴹᵐḾḿṀṁṂṃₘℳⅯⅿ⒨ⓂⓜＭｍ𝐌𝐦𝑀𝑚𝑴𝒎𝓂𝓜𝓶𝔐𝔪𝕄𝕞𝕸𝖒𝖬𝗆𝗠𝗺𝘔𝘮𝙈𝙢𝙼𝚖🄜🄼🅜🅼]"
_equivalence_table['N']=_equivalence_table['n']="[NnÑñŃńŅņŇňǸǹᴺṄṅṆṇṈṉṊṋⁿₙℕ⒩ⓃⓝꞤꞥＮｎ𝐍𝐧𝑁𝑛𝑵𝒏𝒩𝓃𝓝𝓷𝔑𝔫𝕟𝕹𝖓𝖭𝗇𝗡𝗻𝘕𝘯𝙉𝙣𝙽𝚗🄝🄽🅝🅽]"
_equivalence_table['O']=_equivalence_table['o']="[OoºÒÓÔÕÖØòóôõöøŌōŎŏŐőƠơǑǒǪǫǬǭǾǿȌȍȎȏȪȫȬȭȮȯȰȱᴼᵒṌṍṎṏṐṑṒṓỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợₒℴ⒪ⓄⓞꞜꞝＯｏ𝐎𝐨𝑂𝑜𝑶𝒐𝒪𝓞𝓸𝔒𝔬𝕆𝕠𝕺𝖔𝖮𝗈𝗢𝗼𝘖𝘰𝙊𝙤𝙾𝚘🄞🄾🅞🅾]"
_equivalence_table['P']=_equivalence_table['p']="[PpᴾᵖṔṕṖṗₚℙ⒫ⓅⓟＰｐ𝐏𝐩𝑃𝑝𝑷𝒑𝒫𝓅𝓟𝓹𝔓𝔭𝕡𝕻𝖕𝖯𝗉𝗣𝗽𝘗𝘱𝙋𝙥𝙿𝚙🄟🄿🅟🅿🆊]"
_equivalence_table['Q']=_equivalence_table['q']="[Qqℚ⒬ⓆⓠＱｑ𝐐𝐪𝑄𝑞𝑸𝒒𝒬𝓆𝓠𝓺𝔔𝔮𝕢𝕼𝖖𝖰𝗊𝗤𝗾𝘘𝘲𝙌𝙦𝚀𝚚🄠🅀🅠🆀]"
_equivalence_table['R']=_equivalence_table['r']="[RrŔŕŖŗŘřȐȑȒȓʳᴿᵣṘṙṚṛṜṝṞṟℛℜℝ⒭ⓇⓡꞂꞃꞦꞧＲｒ𝐑𝐫𝑅𝑟𝑹𝒓𝓇𝓡𝓻𝔯𝕣𝕽𝖗𝖱𝗋𝗥𝗿𝘙𝘳𝙍𝙧𝚁𝚛🄡🄬🅁🅡🆁]"
_equivalence_table['S']=_equivalence_table['s']="[SsŚśŜŝŞşŠšſȘșˢṠṡṢṣṤṥṦṧṨṩẛₛ⒮ⓈⓢꞄꞅꞨꞩＳｓ𝐒𝐬𝑆𝑠𝑺𝒔𝒮𝓈𝓢𝓼𝔖𝔰𝕊𝕤𝕾𝖘𝖲𝗌𝗦𝘀𝘚𝘴𝙎𝙨𝚂𝚜🄢🄪🅂🅢🆂]"
_equivalence_table['T']=_equivalence_table['t']="[TtŢţŤťȚțᵀᵗṪṫṬṭṮṯṰṱẗₜ⒯ⓉⓣꞆꞇＴｔ𝐓𝐭𝑇𝑡𝑻𝒕𝒯𝓉𝓣𝓽𝔗𝔱𝕋𝕥𝕿𝖙𝖳𝗍𝗧𝘁𝘛𝘵𝙏𝙩𝚃𝚝🄣🅃🅣🆃]"
_equivalence_table['U']=_equivalence_table['u']="[UuÙÚÛÜùúûüŨũŪūŬŭŮůŰűŲųƯưǓǔǕǖǗǘǙǚǛǜȔȕȖȗᵁᵘᵤṲṳṴṵṶṷṸṹṺṻỤụỦủỨứỪừỬửỮữỰự⒰ⓊⓤꞞꞟＵｕ𝐔𝐮𝑈𝑢𝑼𝒖𝒰𝓊𝓤𝓾𝔘𝔲𝕌𝕦𝖀𝖚𝖴𝗎𝗨𝘂𝘜𝘶𝙐𝙪𝚄𝚞🄤🅄🅤🆄]"
_equivalence_table['V']=_equivalence_table['v']="[VvᵛᵥṼṽṾṿⅤⅴ⒱ⓋⓥⱽＶｖ𝐕𝐯𝑉𝑣𝑽𝒗𝒱𝓋𝓥𝓿𝔙𝔳𝕍𝕧𝖁𝖛𝖵𝗏𝗩𝘃𝘝𝘷𝙑𝙫𝚅𝚟🄥🅅🅥🆅]"
_equivalence_table['W']=_equivalence_table['w']="[WwŴŵʷᵂẀẁẂẃẄẅẆẇẈẉẘ⒲ⓌⓦＷｗ𝐖𝐰𝑊𝑤𝑾𝒘𝒲𝓌𝓦𝔀𝔚𝔴𝕎𝕨𝖂𝖜𝖶𝗐𝗪𝘄𝘞𝘸𝙒𝙬𝚆𝚠🄦🅆🅦🆆]"
_equivalence_table['X']=_equivalence_table['x']="[XxˣẊẋẌẍₓⅩⅹ⒳ⓍⓧＸｘ𝐗𝐱𝑋𝑥𝑿𝒙𝒳𝓍𝓧𝔁𝔛𝔵𝕏𝕩𝖃𝖝𝖷𝗑𝗫𝘅𝘟𝘹𝙓𝙭𝚇𝚡🄧🅇🅧🆇]"
_equivalence_table['Y']=_equivalence_table['y']="[YyÝýÿŶŷŸȲȳʸẎẏẙỲỳỴỵỶỷỸỹ⒴ⓎⓨＹｙ𝐘𝐲𝑌𝑦𝒀𝒚𝒴𝓎𝓨𝔂𝔜𝔶𝕐𝕪𝖄𝖞𝖸𝗒𝗬𝘆𝘠𝘺𝙔𝙮𝚈𝚢🄨🅈🅨🆈]"
_equivalence_table['Z']=_equivalence_table['z']="[ZzŹźŻżŽžᶻẐẑẒẓẔẕℤℨ⒵ⓏⓩＺｚ𝐙𝐳𝑍𝑧𝒁𝒛𝒵𝓏𝓩𝔃𝔷𝕫𝖅𝖟𝖹𝗓𝗭𝘇𝘡𝘻𝙕𝙯𝚉𝚣🄩🅉🅩🆉]"


def equivalence(string: str):
    '''Given an ASCII string, return a regex that replaces each letter
    with a bracket expression matching "equivalent" Unicode characters.
    E.g., 'e' -> '[EeÈÉÊËèéêëĒēĔĕĖėĘęĚěȄȅȆȇȨȩᴱᵉḔḕḖḗḘḙḚḛḜḝẸẹẺẻẼẽẾếỀềỂểỄễỆệₑℯℰⅇ⒠ⒺⓔＥｅ𝐄𝐞𝐸𝑒𝑬𝒆𝓔𝓮𝔈𝔢𝔼𝕖𝕰𝖊𝖤𝖾𝗘𝗲𝘌𝘦𝙀𝙚𝙴𝚎🄔🄴🅔🅴]'    '''
    return ''.join([ _equivalence_table.get(k, k) for k in string ])


# Use eqv() for Latin-1 characters only (faster matching than Unicode)
_eqv_table={}
for i in _equivalence_table:
    _eqv_table[i] = ''.join( x for x in _equivalence_table[i] if ord(x)<256 )

def eqv(string: str):
    '''Given an ASCII string, return a regex that replaces each letter
    with a bracket expression matching "equivalent" Latin-1 characters.
    E.g., 'e' -> '[EeÈÉÊËèéêë]'    '''
    return ''.join([ _eqv_table.get(k, k) for k in string ])

